app/controllers/admin/products_controller.rb

  def edit
    @product = Product.find(params[:id])
    @categories = Category.all
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "categories".* FROM "categories"

  def new
    @product = Product.new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @categories = Category.all
    @product = Product.new(product_params)
    if params[:category_ids] && @product.save
      category_ids = params[:category_ids]
      category_ids.each do |id|
        category = Category.find(id)
        ProductsCategory.create(category_id: category.id, product_id: @product.id)
---
INSERT INTO "products" ("name", "price", "description", "image_url", "stock", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "products_categories" ("category_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category_id", 2], ["product_id", 8], ["created_at", "2016-06-16 18:45:07.645524"], ["updated_at", "2016-06-16 18:45:07.645524"]]