app/views/carts/show.html.haml

      - product_id = product_id.to_i
      - product = Product.find(product_id)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 8]]

          %ul
          - product.categories.each do |cat|
---
SELECT "categories".* FROM "categories" INNER JOIN "products_categories" ON "categories"."id" = "products_categories"."category_id" WHERE "products_categories"."product_id" = $1  [["product_id", 8]]