app/views/admin/products/index.html.haml

SELECT "categories".* FROM "categories" INNER JOIN "products_categories" ON "categories"."id" = "products_categories"."category_id" WHERE "products_categories"."product_id" = $1  [["product_id", 1]]
---
        %ul
        - product.categories.each do |cat|