app/controllers/carts_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 8]]
UPDATE "users" SET "shoppingcart" = '{#<Product:0x007f8d0108d4b0>}' WHERE "users"."id" = $1  [["id", 3]]
---
  def index
    @user = current_user
    @product = Product.find(params[:product])
    cart = @user.shoppingcart
    cart << @product.id.to_s
    @user.update_columns(shoppingcart: cart)