app/views/categories/show.html.haml

%div.row
  - @category.products.each do |product|
---
SELECT "products".* FROM "products" INNER JOIN "products_categories" ON "products"."id" = "products_categories"."product_id" WHERE "products_categories"."category_id" = $1  [["category_id", 1]]

            = product.name
            -product.categories.each do |cat|
---
SELECT "categories".* FROM "categories" INNER JOIN "products_categories" ON "categories"."id" = "products_categories"."category_id" WHERE "products_categories"."product_id" = $1  [["product_id", 4]]