app/views/products/index.html.haml

            = product.name
            -product.categories.each do |cat|
---
SELECT "categories".* FROM "categories" INNER JOIN "products_categories" ON "categories"."id" = "products_categories"."category_id" WHERE "products_categories"."product_id" = $1  [["product_id", 1]]